In [36]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

In [55]:
dataset=pd.read_excel('salary.xlsx',header=None)

In [37]:
dataset

     Location  Age   Experiece   Salary Married
0     Kolkata    42         10  45000.0     YES
1       Delhi    31          3  32000.0      NO
2      Mumbai    33          4  34000.0      NO
3  Chandigarh    32          5      NaN      NO

In [56]:
X=dataset.iloc[:,:-1].values
Y=dataset.iloc[:,3].values

In [39]:
X

array([['Kolkata', 42, 10, 45000.0],
       ['Delhi', 31, 3, 32000.0],
       ['Mumbai', 33, 4, 34000.0],
       ['Chandigarh', 32, 5, nan]], dtype=object)

In [40]:
Y

array([45000., 32000., 34000.,    nan])

In [61]:
from sklearn.impute import SimpleImputer
imputer=SimpleImputer(missing_values=np.nan,strategy='mean',fill_value='None')

In [62]:
X

array([['Location', 'Age ', 'Experiece', 'Salary'],
       ['Kolkata', 42, 10, 45000],
       ['Delhi', 31, 3, 32000],
       ['Mumbai', 33, 4, 34000],
       ['Chandigarh', 32, 5, nan]], dtype=object)

In [42]:
Y

array([45000., 32000., 34000.,    nan])

In [45]:
 
from sklearn.impute import SimpleImputer 
imputer=SimpleImputer(missing_values=np.nan,strategy='mean',fill_value=None )
imputer=imputer.fit(X[:,1:3])
X[:,1:3]=imputer.transform(X[:,1:3])

In [50]:
X

array([['Kolkata', 42.0, 10.0, 45000.0],
       ['Delhi', 31.0, 3.0, 32000.0],
       ['Mumbai', 33.0, 4.0, 34000.0],
       ['Chandigarh', 32.0, 5.0, nan]], dtype=object)

In [66]:

# count the number of missing values for each column
num_missing = (dataset[[1,2,3]] == 0).sum()
dataset[[1,2,3]] = dataset[[1,2,3]].replace(0, np.nan)
print(dataset.isnull().sum())

0    0
1    0
2    0
3    1
4    0
dtype: int64